
function SameNetDel(strArray){
	var i=0;
	var FindSameNet=0;


	ArrayLength=strArray.length;
	for (i=0;i<strArray.length;) {
		
		//标志位复位
		FindSameNet=0;

		//  -------------------------------------------------------------------------------------
		//	每个网络名依次从它的下一个网络名开始找，直到最后一个网络名
		//	如果找到了相同的网络名，标志位置位，删除匹配的网络名，但不能删除本身的网络名
		//  -------------------------------------------------------------------------------------
		for (j=i+1;j<strArray.length;) {
			if (strArray[i] == strArray[j]) {
				FindSameNet=1;
				strArray.splice(j);
			}
		}

		//  -------------------------------------------------------------------------------------
		//	如果找到了相同的网络名，那么要把本身的网络名从数组里面删掉。
		//	如果没有找到相同的网络名，就要找下一个网络名了，因此i++
		//  -------------------------------------------------------------------------------------
		if (FindSameNet==1) {
			strArray.splice(i);
		}
		else {
			i++；
		}

	}

}

SameNetDel();